Revit 2027 API
ParameterTypeId.ContinuousFootingStructuralUsage Property
 "Structural Usage"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId ContinuousFootingStructuralUsage { get; }
Public Shared ReadOnly Property ContinuousFootingStructuralUsage As ForgeTypeId
	Get
public:
static property ForgeTypeId^ ContinuousFootingStructuralUsage {
	ForgeTypeId^ get ();
}
static member ContinuousFootingStructuralUsage : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace